In [1]:
import pandas as pd

In [2]:
d1=[100,200,300,400,500] #list
d2=(501,502,503,504,505) #tuple
d3=['pune','mumbai','nashik','delhi','banglore'] #list
d4={'A':11,'B':12,'C':13,'D':14,'E':15} #dictionary

In [3]:
pd.Series(d1)

0    100
1    200
2    300
3    400
4    500
dtype: int64

In [4]:
type(pd.Series(d1))

pandas.core.series.Series

In [5]:
pd.Series(data=d3,index=d1)

100        pune
200      mumbai
300      nashik
400       delhi
500    banglore
dtype: object

In [6]:
pd.Series(d3,d1)

100        pune
200      mumbai
300      nashik
400       delhi
500    banglore
dtype: object

In [7]:
pd.Series(d3,d2)

501        pune
502      mumbai
503      nashik
504       delhi
505    banglore
dtype: object

In [8]:
d4

{'A': 11, 'B': 12, 'C': 13, 'D': 14, 'E': 15}

In [9]:
pd.Series(d4)

A    11
B    12
C    13
D    14
E    15
dtype: int64

In [10]:
pd.Series(d4,d3)

pune       NaN
mumbai     NaN
nashik     NaN
delhi      NaN
banglore   NaN
dtype: float64

In [11]:
pd.Series(d3,d4)

A        pune
B      mumbai
C      nashik
D       delhi
E    banglore
dtype: object

In [12]:
s1=pd.Series([10,20,30,40,50],['pune','mumbai','nashik','delhi','banglore'])

In [13]:
s2=pd.Series([10,20,30,40,50],['pune','mumbai','nashik','hyderabad','banglore'])

In [14]:
s1

pune        10
mumbai      20
nashik      30
delhi       40
banglore    50
dtype: int64

In [15]:
s2

pune         10
mumbai       20
nashik       30
hyderabad    40
banglore     50
dtype: int64

In [16]:
##Dataframe

In [17]:
import numpy as np

In [18]:
np.random.randn(5,4)

array([[-0.55731359, -0.88303626, -0.01681959,  0.19976858],
       [-1.20468688,  1.21413914,  1.07460818,  1.74481416],
       [-1.23992457,  0.63402772, -0.76637073,  2.49808064],
       [ 0.4814205 , -0.39532337,  1.80275065, -3.22545518],
       [ 1.03804151, -2.65075795,  1.63599782, -1.0017958 ]])

In [19]:
data=pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [20]:
data

          W         X         Y         Z
A -1.402867 -0.592402  1.411873  1.048448
B -0.248448 -1.018437 -0.377555 -0.032509
C -0.288109 -1.351670  0.106141  1.166296
D  2.631805  0.654138 -0.827775  0.359222
E -0.091955  1.084590 -1.308283  0.485734

In [21]:
type(data)

pandas.core.frame.DataFrame

In [22]:
data.shape

(5, 4)

In [23]:
data

          W         X         Y         Z
A -1.402867 -0.592402  1.411873  1.048448
B -0.248448 -1.018437 -0.377555 -0.032509
C -0.288109 -1.351670  0.106141  1.166296
D  2.631805  0.654138 -0.827775  0.359222
E -0.091955  1.084590 -1.308283  0.485734

In [24]:
data.loc['B']

W   -0.248448
X   -1.018437
Y   -0.377555
Z   -0.032509
Name: B, dtype: float64

In [25]:
type(data.loc['B'])

pandas.core.series.Series

In [26]:
data[['W']]

          W
A -1.402867
B -0.248448
C -0.288109
D  2.631805
E -0.091955

In [27]:
data.loc['B','Y']

-0.3775549823650225

In [28]:
data[data['W']>0]['Z']

D    0.359222
Name: Z, dtype: float64

In [29]:
data.loc[data['W'] > 0, 'Z']

D    0.359222
Name: Z, dtype: float64

In [30]:
data

          W         X         Y         Z
A -1.402867 -0.592402  1.411873  1.048448
B -0.248448 -1.018437 -0.377555 -0.032509
C -0.288109 -1.351670  0.106141  1.166296
D  2.631805  0.654138 -0.827775  0.359222
E -0.091955  1.084590 -1.308283  0.485734

In [31]:
data['new_column']=data['W']+data['X']

In [32]:
data

          W         X         Y         Z  new_column
A -1.402867 -0.592402  1.411873  1.048448   -1.995269
B -0.248448 -1.018437 -0.377555 -0.032509   -1.266885
C -0.288109 -1.351670  0.106141  1.166296   -1.639779
D  2.631805  0.654138 -0.827775  0.359222    3.285944
E -0.091955  1.084590 -1.308283  0.485734    0.992635

In [33]:
data.drop('new_column',axis=1)

          W         X         Y         Z
A -1.402867 -0.592402  1.411873  1.048448
B -0.248448 -1.018437 -0.377555 -0.032509
C -0.288109 -1.351670  0.106141  1.166296
D  2.631805  0.654138 -0.827775  0.359222
E -0.091955  1.084590 -1.308283  0.485734

In [34]:
data.drop("new_column",axis=1,inplace=True)

In [35]:
d3

['pune', 'mumbai', 'nashik', 'delhi', 'banglore']

In [36]:
data.index=d3
data

                 W         X         Y         Z
pune     -1.402867 -0.592402  1.411873  1.048448
mumbai   -0.248448 -1.018437 -0.377555 -0.032509
nashik   -0.288109 -1.351670  0.106141  1.166296
delhi     2.631805  0.654138 -0.827775  0.359222
banglore -0.091955  1.084590 -1.308283  0.485734

In [37]:
data.reset_index()

      index         W         X         Y         Z
0      pune -1.402867 -0.592402  1.411873  1.048448
1    mumbai -0.248448 -1.018437 -0.377555 -0.032509
2    nashik -0.288109 -1.351670  0.106141  1.166296
3     delhi  2.631805  0.654138 -0.827775  0.359222
4  banglore -0.091955  1.084590 -1.308283  0.485734

In [38]:
data.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [39]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, pune to banglore
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [40]:
##multi index and index hierarchy

In [41]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]

In [42]:
h1=list(zip(outside,inside))

In [43]:
h1

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [44]:
hier_index = pd.MultiIndex.from_tuples(h1)

In [45]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [46]:
df=pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [47]:
df.index.names = ['Group','Num']

In [48]:
df.xs('G1')

            A         B
Num
1   -1.540580  0.081113
2    1.802697  0.024826
3   -0.701908  0.356683

In [49]:
df.xs(('G1',1))

A   -1.540580
B    0.081113
Name: (G1, 1), dtype: float64

In [50]:
df.xs(('G2',2))

A   -0.288888
B    0.313222
Name: (G2, 2), dtype: float64

In [51]:
df.xs(1,level='Num')

              A         B
Group
G1    -1.540580  0.081113
G2     0.736994 -2.085445

In [52]:
##Missin data

In [53]:
import numpy as nu
import pandas as pd

In [54]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [55]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [56]:
df=pd.DataFrame(d)

In [57]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [58]:
df.isna()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [59]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [60]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [61]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [62]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [63]:
df.dropna(thresh=1) #atleast one non null

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [64]:
df.dropna(thresh=3,axis=1) #atleast three non null

   C
0  1
1  2
2  3

In [65]:
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [66]:
df.fillna(df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3